Revit 2020 API
Dimension.LeaderEndPosition Property
 The position of the dimension's leader end point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Since: 2015 Subscription Update
Syntax
C#
public XYZ LeaderEndPosition { get; set; }
Visual Basic
Public Property LeaderEndPosition As XYZ
	Get
	Set
Visual C++
public:
property XYZ^ LeaderEndPosition {
	XYZ^ get ();
	void set (XYZ^ value);
}
Remarks
This property is not applicable to all dimensions. For example, it is not available for spot dimensions, multi-segments dimensions dimensions using equality formula, and when dimension style is ordinate.
If the position is not applicable, this property returns NULL and will not allow setting a value.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was NULL
See Also
Dimension Class
Autodesk.Revit.DB Namespace